In [1]:
import pandas as pd 
import sweetviz as sv

In [2]:
pre_sub = pd.read_csv('../../data/model/submission5.csv')
nn_sub = pd.read_csv('../../data/model/sub_nn.csv')
cat_sub = pd.read_csv('../../data/model/submission3.csv')

In [3]:
pre_sub.head(20)
nn_sub.head(20)
cat_sub.head(20)

    Reservation-id  Reservation_status
0         62931593                   0
1         70586099                   1
2          4230648                   0
3         25192322                   0
4         80931528                   0
5         64700386                   0
6         16938050                   0
7         90487908                   1
8          5595445                   2
9         17502557                   0
10        92229895                   0
11        27386334                   2
12        76765181                   0
13        40697301                   2
14        63963888                   1
15        27282946                   2
16         8696141                   0
17        52621292                   0
18        21821230                   0
19        12316731                   0

    Reservation-id  Reservation_status
0         62931593                   1
1         70586099                   1
2          4230648                   0
3         25192322                   0
4         80931528                   0
5         64700386                   0
6         16938050                   0
7         90487908                   0
8          5595445                   0
9         17502557                   1
10        92229895                   0
11        27386334                   0
12        76765181                   0
13        40697301                   1
14        63963888                   0
15        27282946                   0
16         8696141                   0
17        52621292                   0
18        21821230                   0
19        12316731                   0

    Reservation-id  Reservation_status
0         62931593                   1
1         70586099                   1
2          4230648                   1
3         25192322                   1
4         80931528                   1
5         64700386                   1
6         16938050                   1
7         90487908                   1
8          5595445                   1
9         17502557                   1
10        92229895                   1
11        27386334                   1
12        76765181                   1
13        40697301                   1
14        63963888                   1
15        27282946                   1
16         8696141                   1
17        52621292                   1
18        21821230                   1
19        12316731                   1

In [4]:
pre_sub.iloc[:, 1] = pre_sub.iloc[:, 1]+1
pre_sub.head()

   Reservation-id  Reservation_status
0        62931593                   1
1        70586099                   2
2         4230648                   1
3        25192322                   1
4        80931528                   1

In [3]:
pre_sub = pd.read_csv('../../data/model/submission6.csv')

In [4]:
pre_sub.head(20)

    Reservation-id  Reservation_status
0         62931593                   1
1         70586099                   2
2          4230648                   1
3         25192322                   1
4         80931528                   1
5         64700386                   1
6         16938050                   1
7         90487908                   2
8          5595445                   3
9         17502557                   1
10        92229895                   1
11        27386334                   3
12        76765181                   1
13        40697301                   3
14        63963888                   2
15        27282946                   3
16         8696141                   1
17        52621292                   1
18        21821230                   1
19        12316731                   1

In [5]:
cat_sub = pd.read_csv('../../data/model/submission3.4.csv')

In [6]:
cat_sub.head(20)

    Reservation-id  Reservation_status
0         62931593                   1
1         70586099                   2
2          4230648                   1
3         25192322                   1
4         80931528                   3
5         64700386                   1
6         16938050                   1
7         90487908                   1
8          5595445                   3
9         17502557                   3
10        92229895                   1
11        27386334                   3
12        76765181                   1
13        40697301                   1
14        63963888                   2
15        27282946                   2
16         8696141                   1
17        52621292                   3
18        21821230                   3
19        12316731                   1

In [15]:
sub_report = sv.compare(cat_sub,pre_sub)
sub_report.show_html()

Done! Use 'show' commands to display/save.   |██████████| [100%]   00:01 -> (00:00 left)
Report SWEETVIZ_REPORT.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

In [12]:
thari1_df = pd.read_csv('../../data/model/trari1.csv')

In [13]:
sec_report = sv.compare(pre_sub,thari1_df)
sec_report.show_html()

Done! Use 'show' commands to display/save.   |██████████| [100%]   00:01 -> (00:00 left)
Report SWEETVIZ_REPORT.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.

In [14]:
inter_report = sv.compare(cat_sub,thari1_df)
inter_report.show_html()

Done! Use 'show' commands to display/save.   |██████████| [100%]   00:01 -> (00:00 left)
Report SWEETVIZ_REPORT.html was generated! NOTEBOOK/COLAB USERS: the web browser MAY not pop up, regardless, the report IS saved in your notebook/colab files.